{
  "format": "graph-model",
  "generatedBy": "2.15.1",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature": {
    "inputs": {
      "input_2": {
        "name": "input_2:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "240" },
            { "size": "240" },
            { "size": "3" }
          ]
        }
      }
    },
    "outputs": {
      "dense_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "12" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "10" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "10" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "10" },
                  { "size": "10" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "10" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/flatten_1/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "33640" }, { "size": "12" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "12" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "input_2",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "240" },
                { "size": "240" },
                { "size": "3" }
              ]
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu",
        "op": "_FusedConv2D",
        "input": [
          "input_2",
          "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "_input_shapes": {
            "list": {
              "shape": [
                {
                  "dim": [
                    { "size": "-2" },
                    { "size": "-3" },
                    { "size": "-4" },
                    { "size": "-5" }
                  ]
                },
                {
                  "dim": [
                    { "size": "3" },
                    { "size": "3" },
                    { "size": "3" },
                    { "size": "10" }
                  ]
                }
              ]
            }
          },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "VkFMSUQ=" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_1/conv2d_2/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "_input_shapes": {
            "list": {
              "shape": [
                {
                  "dim": [
                    { "size": "-2" },
                    { "size": "-8" },
                    { "size": "-9" },
                    { "size": "10" }
                  ]
                },
                {
                  "dim": [
                    { "size": "3" },
                    { "size": "3" },
                    { "size": "10" },
                    { "size": "10" }
                  ]
                }
              ]
            }
          },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "VkFMSUQ=" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_1/conv2d_3/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
          "StatefulPartitionedCall/sequential_1/flatten_1/Const"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_1/flatten_1/Reshape",
          "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "_input_shapes": {
            "list": {
              "shape": [
                { "dim": [{ "size": "-14" }, { "size": "33640" }] },
                { "dim": [{ "size": "33640" }, { "size": "12" }] }
              ]
            }
          },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense_1/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential_1/dense_1/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_1/dense_1/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1766 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp",
          "shape": [10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
          "shape": [3, 3, 10, 10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp",
          "shape": [10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/flatten_1/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp",
          "shape": [33640, 12],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp",
          "shape": [12],
          "dtype": "float32"
        }
      ]
    }
  ]
}
